
&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	КомандаЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗагрузитьНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	РезультатЗагрузки = ТекОбъект.ЗагрузитьПакет(Пакет);
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		Сообщить(РезультатЗагрузки.Статус);
		Сообщить(СОКРЛП(РезультатЗагрузки.ОписаниеОшибки));
	Иначе
		Сообщить(РезультатЗагрузки);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура КомандаВыгрузитьНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Пакет = ТекОбъект.СформироватьПакет(ЭтотОбъект.ОбъектСсылка);
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаВыгрузить(Команда)
	КомандаВыгрузитьНаСервере();
КонецПроцедуры

//пакет 
//<?xml version="1.0" encoding="windows-1251"?>
//<Пакет Версия="1.0" ID="1584428561" НомерПакета="1" IDОрганизации="1836282" НаименованиеОрганизации="Министерство здравоохранения Воронежской области" ИНН="3666159529" КПП="366401001" ДатаАктуальности="2026-05-20T13:50:02">
//  <Отпуска>
//   <Отпуск ID="453761428" Организация="1836282" Сотрудник="150961980" ФизическоеЛицо="53657180" ФИО="Цурган Д.А." ВидОтпуска="401995089" Действие="Предоставить" НомерПриказа="1193-ро" ДатаПриказа="2026-05-20T00:00:00" ДатаНачалаОсновногоОтпуска="2026-06-01T00:00:00" ДатаОкончанияОсновногоОтпуска="2026-06-10T00:00:00" КоличествоДнейОсновногоОтпуска="10" Исправительный="" ИсправлениеОт="" ПредоставитьОсновнойОтпуск="1" ПредоставитьДополнительныйОтпуск="" ВидЗанятости="основной работник" ПозицияШтатногоРасписания="150942401" КомпСанКур="0" ПредоставитьКомпенсациюОсновногоОтпуска="" КоличествоДнейКомпенсацииОсновногоОтпуска="" ПредоставитьКомпенсациюДополнительногоОтпуска="" КоличествоДнейКомпенсацииДополнительногоОтпуска ="" ПредоставитьМатериальнуюПомощьПриОтпуске="" ПредоставитьЕдиновременнуюВыплатуКОтпуску="0" НачалоПериодаЗаКоторыйПредоставляетсяОтпуск="2023-04-23T00:00:00" КонецПериодаЗаКоторыйПредоставляетсяОтпуск="2024-04-22T00:00:00" ИсправленныйДокумент="" СвязанСУвольнением="0" Руководитель="" ДолжностьРуководителя=""/>
//    <Отпуск ID="453761428" Организация="1836282" Сотрудник="150961980" ФизическоеЛицо="53657180" ФИО="Цурган Д.А." ВидОтпуска="401995089" Действие="Предоставить" НомерПриказа="1193-ро" ДатаПриказа="2026-05-20T00:00:00" ДатаНачалаОсновногоОтпуска="2026-06-11T00:00:00" ДатаОкончанияОсновногоОтпуска="2026-06-15T00:00:00" КоличествоДнейОсновногоОтпуска="4" Исправительный="" ИсправлениеОт="" ПредоставитьОсновнойОтпуск="1" ПредоставитьДополнительныйОтпуск="" ВидЗанятости="основной работник" ПозицияШтатногоРасписания="150942401" КомпСанКур="0" ПредоставитьКомпенсациюОсновногоОтпуска="" КоличествоДнейКомпенсацииОсновногоОтпуска="" ПредоставитьКомпенсациюДополнительногоОтпуска="" КоличествоДнейКомпенсацииДополнительногоОтпуска ="" ПредоставитьМатериальнуюПомощьПриОтпуске="" ПредоставитьЕдиновременнуюВыплатуКОтпуску="0" НачалоПериодаЗаКоторыйПредоставляетсяОтпуск="2024-04-23T00:00:00" КонецПериодаЗаКоторыйПредоставляетсяОтпуск="2025-04-22T00:00:00" ИсправленныйДокумент="" СвязанСУвольнением="0" Руководитель="" ДолжностьРуководителя=""/>
//    <Отпуск ID="453761428" Организация="1836282" Сотрудник="150961980" ФизическоеЛицо="53657180" ФИО="Цурган Д.А." ВидОтпуска="106790553" Действие="Предоставить" НомерПриказа="1193-ро" ДатаПриказа="2026-05-20T00:00:00" ДатаНачалаОсновногоОтпуска="" ДатаОкончанияОсновногоОтпуска="" КоличествоДнейОсновногоОтпуска="0" Исправительный="" ИсправлениеОт="" ПредоставитьОсновнойОтпуск="1" ПредоставитьДополнительныйОтпуск="" ВидЗанятости="основной работник" ПозицияШтатногоРасписания="150942401" КомпСанКур="0" ПредоставитьКомпенсациюОсновногоОтпуска="1" КоличествоДнейКомпенсацииОсновногоОтпуска="0" ПредоставитьКомпенсациюДополнительногоОтпуска="" КоличествоДнейКомпенсацииДополнительногоОтпуска ="" ПредоставитьМатериальнуюПомощьПриОтпуске="" ПредоставитьЕдиновременнуюВыплатуКОтпуску="1" НачалоПериодаЗаКоторыйПредоставляетсяОтпуск="2026-01-01T00:00:00" КонецПериодаЗаКоторыйПредоставляетсяОтпуск="2026-12-31T00:00:00" ИсправленныйДокумент="" СвязанСУвольнением="0" Руководитель="" ДолжностьРуководителя=""/>
//    <Отпуск ID="453761428" Организация="1836282" Сотрудник="150961980" ФизическоеЛицо="53657180" ФИО="Цурган Д.А." ВидОтпуска="106733692" Действие="Предоставить" НомерПриказа="1193-ро" ДатаПриказа="2026-05-20T00:00:00" ДатаНачалаОсновногоОтпуска="" ДатаОкончанияОсновногоОтпуска="" КоличествоДнейОсновногоОтпуска="0" Исправительный="" ИсправлениеОт="" ПредоставитьОсновнойОтпуск="1" ПредоставитьДополнительныйОтпуск="" ВидЗанятости="основной работник" ПозицияШтатногоРасписания="150942401" КомпСанКур="0" ПредоставитьКомпенсациюОсновногоОтпуска="1" КоличествоДнейКомпенсацииОсновногоОтпуска="0" ПредоставитьКомпенсациюДополнительногоОтпуска="" КоличествоДнейКомпенсацииДополнительногоОтпуска ="" ПредоставитьМатериальнуюПомощьПриОтпуске="1" ПредоставитьЕдиновременнуюВыплатуКОтпуску="0" НачалоПериодаЗаКоторыйПредоставляетсяОтпуск="2026-01-01T00:00:00" КонецПериодаЗаКоторыйПредоставляетсяОтпуск="2026-12-31T00:00:00" ИсправленныйДокумент="" СвязанСУвольнением="0" Руководитель="" ДолжностьРуководителя=""/>
//   </Отпуска>
//</Пакет>

//28.05.2026
//<?xml version="1.0" encoding="windows-1251"?>
//<Пакет Версия="1.0" ID="1584585429" НомерПакета="1" IDОрганизации="1670621" НаименованиеОрганизации="Министерство имущественных и земельных отношений Воронежской области" ИНН="3666057069" КПП="366601001" ДатаАктуальности="2026-05-28T18:58:58">
//  <Отпуска>
//    <Отпуск ID="454098619" Организация="1670621" Сотрудник="171214200" ФизическоеЛицо="53651513" ФИО="Крупенникова Е.С." ВидОтпуска="106733692" Действие="Предоставить" НомерПриказа="1320-ро" ДатаПриказа="2026-05-28T00:00:00" ДатаНачалаОсновногоОтпуска="" ДатаОкончанияОсновногоОтпуска="" КоличествоДнейОсновногоОтпуска="0" Исправительный="" ИсправлениеОт="" ПредоставитьОсновнойОтпуск="1" ПредоставитьДополнительныйОтпуск="" ВидЗанятости="основной работник" ПозицияШтатногоРасписания="164331246" КомпСанКур="0" ПредоставитьКомпенсациюОсновногоОтпуска="1" КоличествоДнейКомпенсацииОсновногоОтпуска="0" ПредоставитьКомпенсациюДополнительногоОтпуска="" КоличествоДнейКомпенсацииДополнительногоОтпуска ="" ПредоставитьМатериальнуюПомощьПриОтпуске="1" ПредоставитьЕдиновременнуюВыплатуКОтпуску="0" НачалоПериодаЗаКоторыйПредоставляетсяОтпуск="2026-01-01T00:00:00" КонецПериодаЗаКоторыйПредоставляетсяОтпуск="2026-12-31T00:00:00" ИсправленныйДокумент="" СвязанСУвольнением="0" Руководитель="" ДолжностьРуководителя=""/>
//    <Отпуск ID="454098619" Организация="1670621" Сотрудник="171214200" ФизическоеЛицо="53651513" ФИО="Крупенникова Е.С." ВидОтпуска="106790553" Действие="Предоставить" НомерПриказа="1320-ро" ДатаПриказа="2026-05-28T00:00:00" ДатаНачалаОсновногоОтпуска="" ДатаОкончанияОсновногоОтпуска="" КоличествоДнейОсновногоОтпуска="0" Исправительный="" ИсправлениеОт="" ПредоставитьОсновнойОтпуск="1" ПредоставитьДополнительныйОтпуск="" ВидЗанятости="основной работник" ПозицияШтатногоРасписания="164331246" КомпСанКур="0" ПредоставитьКомпенсациюОсновногоОтпуска="1" КоличествоДнейКомпенсацииОсновногоОтпуска="0" ПредоставитьКомпенсациюДополнительногоОтпуска="" КоличествоДнейКомпенсацииДополнительногоОтпуска ="" ПредоставитьМатериальнуюПомощьПриОтпуске="" ПредоставитьЕдиновременнуюВыплатуКОтпуску="1" НачалоПериодаЗаКоторыйПредоставляетсяОтпуск="2026-01-01T00:00:00" КонецПериодаЗаКоторыйПредоставляетсяОтпуск="2026-12-31T00:00:00" ИсправленныйДокумент="" СвязанСУвольнением="0" Руководитель="" ДолжностьРуководителя=""/>
//    <Отпуск ID="454098619" Организация="1670621" Сотрудник="171214200" ФизическоеЛицо="53651513" ФИО="Крупенникова Е.С." ВидОтпуска="103566120" Действие="Предоставить" НомерПриказа="1320-ро" ДатаПриказа="2026-05-28T00:00:00" ДатаНачалаОсновногоОтпуска="" ДатаОкончанияОсновногоОтпуска="" КоличествоДнейОсновногоОтпуска="0" Исправительный="" ИсправлениеОт="" ПредоставитьОсновнойОтпуск="1" ПредоставитьДополнительныйОтпуск="" ВидЗанятости="основной работник" ПозицияШтатногоРасписания="164331246" КомпСанКур="30" ПредоставитьКомпенсациюОсновногоОтпуска="1" КоличествоДнейКомпенсацииОсновногоОтпуска="0" ПредоставитьКомпенсациюДополнительногоОтпуска="" КоличествоДнейКомпенсацииДополнительногоОтпуска ="" ПредоставитьМатериальнуюПомощьПриОтпуске="" ПредоставитьЕдиновременнуюВыплатуКОтпуску="0" НачалоПериодаЗаКоторыйПредоставляетсяОтпуск="2026-01-01T00:00:00" КонецПериодаЗаКоторыйПредоставляетсяОтпуск="2026-12-31T00:00:00" ИсправленныйДокумент="" СвязанСУвольнением="0" Руководитель="" ДолжностьРуководителя=""/>
//   </Отпуска>
//</Пакет>

